app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at", "role") VALUES (?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin)
    if @admin.save

UPDATE "admins" SET "role" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["role", 0], ["encrypted_password", "$2a$11$Zz9wSRszVw8Tm/LSpdyt0OVCwExNUbM6CoAZmGylgVYGp.P/Y6OCy"], ["updated_at", "2017-12-05 19:27:43.917257"], ["id", 2]]
---
  def update
    if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]
---
  def destroy
    admin_email = @admin.email

    if @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? ORDER BY "admins"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_admin
      @admin = Admin.find(params[:id])