app/controllers/backoffice/categories_controller.rb

  def create
    @category = CategoryService.create(params_category)
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "PC Hardware"], ["created_at", "2017-11-30 18:21:30.896589"], ["updated_at", "2017-11-30 18:21:30.896589"]]

  def update
    if @category.update(params_category)
---
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "PC Hardware New"], ["updated_at", "2017-11-30 21:04:34.130187"], ["id", 11]]

    def set_category
      @category = Category.friendly.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]